run/mShock_XuAslamStewart_1D/system/sampleAlongLine
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          sampleAlongLine;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            ("libsampling.so");

setFormat raw;

start   (-1 0 0);
end     (13 0 0);
fields  (rho U p T products);

setConfig
{
    axis    x;
}

interpolationScheme     cellPointFace; //cellPointFace cellPoint cell

sets
(
    line
    {
        type     lineFace;

        $setConfig;
        start $start;
        end   $end;
    }
);


// ************************************************************************* //
